"""
Домашнее задание №1
Цикл for: Продажи товаров
* Дан список словарей с данными по колличеству проданных телефонов
  [
    {'product': 'iPhone 12', 'items_sold': [363, 500, 224, 358, 480, 476, 470, 216, 270, 388, 312, 186]}, 
    {'product': 'Xiaomi Mi11', 'items_sold': [317, 267, 290, 431, 211, 354, 276, 526, 141, 453, 510, 316]},
    {'product': 'Samsung Galaxy 21', 'items_sold': [343, 390, 238, 437, 214, 494, 441, 518, 212, 288, 272, 247]},
  ]
* Посчитать и вывести суммарное количество продаж для каждого товара
* Посчитать и вывести среднее количество продаж для каждого товара
* Посчитать и вывести суммарное количество продаж всех товаров
* Посчитать и вывести среднее количество продаж всех товаров
"""
phones_sales = [
    {'product': 'iPhone 12', 'items_sold': [363, 500, 224, 358, 480, 476, 470, 216, 270, 388, 312, 186]}, 
    {'product': 'Xiaomi Mi11', 'items_sold': [317, 267, 290, 431, 211, 354, 276, 526, 141, 453, 510, 316]},
    {'product': 'Samsung Galaxy 21', 'items_sold': [343, 390, 238, 437, 214, 494, 441, 518, 212, 288, 272, 247]},
  ]
  

total_sold = 0
for sold_phone in phones_sales:
  sum_sold = sum(sold_phone['items_sold'])
  total_sold += sum_sold
  avg_sold = sum_sold / len(sold_phone['items_sold'])
  print(f"Суммарное количество продаж для: {sold_phone['product']} — {sum_sold} шт.")
  print(f"Cреднее количество продаж для: {sold_phone['product']} — {round(avg_sold, 2)} шт.")
print(f"Среднее количество продаж всех товаров: {round(total_sold / len (phones_sales[0]['items_sold']), 2)} шт.")
print(f'Суммарное количество продаж всех товаров: {total_sold} шт.')